# GetConversionData Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RevitLinkType..::..GetConversionData Method
RevitLinkType Class See Also
---
Returns the optional data that is necessary to generate the Revit file for this link.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public LinkConversionData GetConversionData()
```

Visual Basic
---
```text
Public Function GetConversionData As LinkConversionData
```

Visual C++
---
```text
public:
LinkConversionData^ GetConversionData()
```

# ### Return Value
The RvtLinkConversionData containing the necessary information.
# See Also
RevitLinkType Class
Autodesk.Revit.DB Namespace